vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA176_DFP.pdsc
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.messaging.condition_id">
      <require condition="allOf.component.lists, component.mem_manager, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, component.mem_manager, device=MCXA176.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.romapi, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.romapi, device=MCXA176.internal_condition">
      <require condition="anyOf.driver.romapi.internal_condition"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.romapi, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ostimer, device=MCXA176.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.ostimer_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.power_manager_framework.condition_id">
      <require condition="allOf.anyOf=driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu, component.lists, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu, component.lists, device=MCXA176.internal_condition">
      <require condition="anyOf.driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.common, driver.crc, driver.mcx_cmc, driver.mcx_spc, driver.mcx_vbat, driver.wuu.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_cmc"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_spc"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_vbat"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wuu"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXA176.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXA176.internal_condition">
      <require condition="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition">
      <accept condition="allOf.component.lpspi_adapter, driver.lpspi.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpspi_adapter, driver.lpspi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, component.lpuart_adapter, device=MCXA176.internal_condition"/>
    </condition>
