vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA176_DFP.pdsc
    <condition id="allOf.anyOf=driver.lpuart, component.lpuart_adapter, device=MCXA176.internal_condition">
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.aead.condition_id">
      <require condition="allOf.component.sgi_pkc.aes, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aes, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aes"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.aead_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.aead, component.sgi_pkc.mac_modes, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aead, component.sgi_pkc.mac_modes, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac_modes"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.aes.condition_id">
      <require condition="allOf.component.sgi_pkc.crc, component.sgi_pkc.key, component.sgi_pkc.prng, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.crc, component.sgi_pkc.key, component.sgi_pkc.prng, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_prng"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.buffer.condition_id">
      <require condition="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_core"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_data_integrity"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.cipher.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.cipher_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.cipher, component.sgi_pkc.dma, component.sgi_pkc.padding, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.cipher, component.sgi_pkc.dma, component.sgi_pkc.padding, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_cipher"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_dma"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_padding"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.core.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.crc.condition_id">
      <require condition="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, driver.crc, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.core, component.sgi_pkc.data_integrity, component.sgi_pkc.flow_protection, component.sgi_pkc.toolchain, driver.crc, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_core"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_data_integrity"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="crc"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.data_integrity.condition_id">
      <require condition="allOf.device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.dma.condition_id">
      <require condition="allOf.device=MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.ecc.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.mac, component.sgi_pkc.math, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.mac, component.sgi_pkc.math, component.sgi_pkc.pkc, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_mac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_math"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pkc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.example.condition_id">
      <require condition="allOf.component.sgi_pkc.random_modes, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.random_modes, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random_modes"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples.condition_id">
      <require condition="allOf.component.sgi_pkc.example, component.sgi_pkc.examples_aead, component.sgi_pkc.examples_cipher_modes, component.sgi_pkc.examples_crc, component.sgi_pkc.examples_ecc, component.sgi_pkc.examples_ffdh, component.sgi_pkc.examples_flow_protection, component.sgi_pkc.examples_glikey, component.sgi_pkc.examples_hash_modes, component.sgi_pkc.examples_hmac, component.sgi_pkc.examples_key, component.sgi_pkc.examples_mac_modes, component.sgi_pkc.examples_memory, component.sgi_pkc.examples_random, component.sgi_pkc.examples_random_modes, component.sgi_pkc.examples_rsa, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.example, component.sgi_pkc.examples_aead, component.sgi_pkc.examples_cipher_modes, component.sgi_pkc.examples_crc, component.sgi_pkc.examples_ecc, component.sgi_pkc.examples_ffdh, component.sgi_pkc.examples_flow_protection, component.sgi_pkc.examples_glikey, component.sgi_pkc.examples_hash_modes, component.sgi_pkc.examples_hmac, component.sgi_pkc.examples_key, component.sgi_pkc.examples_mac_modes, component.sgi_pkc.examples_memory, component.sgi_pkc.examples_random, component.sgi_pkc.examples_random_modes, component.sgi_pkc.examples_rsa, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_ecc_example"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_aead"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_cipher"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_ecc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_ffdh"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_glikey"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_hash_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_hmac"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_key"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_mac_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_random"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_random_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_examples_rsa"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_aead.condition_id">
      <require condition="allOf.component.sgi_pkc.aead, component.sgi_pkc.aead_modes, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA176.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.aead, component.sgi_pkc.aead_modes, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.session, device=MCXA176.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_aead_modes"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_memory"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_session"/>
      <require condition="device.MCXA176.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.examples_cipher_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.cipher, component.sgi_pkc.cipher_modes, component.sgi_pkc.examples_flow_protection, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.random_modes, component.sgi_pkc.session, component.sgi_pkc.sgi, device=MCXA176.internal_condition"/>
    </condition>
